src/DataProcessors/КИИ_АнализаторКонфигурации/КИИ_АнализаторКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_АнализаторКонфигурации</name>
  <comment>Интерактивный инструмент анализа конфигурации: дерево метаданных, XML-дамп, EDT-интеграция</comment>
  <attributes>
    <name>ФильтрТиповМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьXMLФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/КИИ_АнализаторКонфигурации/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль формы обработки КИИ_АнализаторКонфигурации
// Интерактивный инструмент для анализа конфигурации:
// - дерево метаданных (построение, просмотр, статистика)
// - XML-дамп (парсинг, извлечение модулей)
// - EDT-интеграция (ошибки, поиск в коде, метаданные)
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Значения по умолчанию
	Если Не ЗначениеЗаполнено(Объект.ИмяПроектаEDT) Тогда
		Объект.ИмяПроектаEDT = "ИИКона_разработки.ИИКона";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Построить дерево метаданных конфигурации.
&НаКлиенте
// ПостроитьДерево.
Процедура ПостроитьДерево(Команда)
	
	РезультатJSON = ПостроитьДеревоНаСервере(Объект.ФильтрТиповМетаданных);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Дерево метаданных", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось построить дерево метаданных.");
	КонецЕсли;
	
КонецПроцедуры

// Получить статистику конфигурации.
&НаКлиенте
// ПолучитьСтатистику.
Процедура ПолучитьСтатистику(Команда)
	
	РезультатJSON = ПолучитьСтатистикуНаСервере();
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Статистика конфигурации", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось получить статистику.");
	КонецЕсли;
	
КонецПроцедуры

// Разобрать XML-дамп конфигурации.
&НаКлиенте
// РазобратьXMLДамп.
Процедура РазобратьXMLДамп(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПутьXMLФайла) Тогда
		ПоказатьПредупреждение(, "Укажите путь к XML-файлу.");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = РазобратьXMLДампНаСервере(Объект.ПутьXMLФайла);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("XML-дамп", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось разобрать XML-файл.");
	КонецЕсли;
	
КонецПроцедуры

// Извлечь модули из XML-дампа.
&НаКлиенте
// ИзвлечьМодули.
Процедура ИзвлечьМодули(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПутьXMLФайла) Тогда
		ПоказатьПредупреждение(, "Укажите путь к XML-файлу.");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = ИзвлечьМодулиНаСервере(Объект.ПутьXMLФайла, Объект.ФильтрТиповМетаданных);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Модули из XML", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось извлечь модули.");
	КонецЕсли;
	
КонецПроцедуры

// Получить ошибки из EDT.
&НаКлиенте
// ОшибкиEDT.
Процедура ОшибкиEDT(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяПроектаEDT) Тогда
		ПоказатьПредупреждение(, "Укажите имя проекта EDT.");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = ПолучитьОшибкиEDTНаСервере(Объект.ИмяПроектаEDT);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Ошибки EDT", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось получить ошибки EDT. Проверьте доступность EDT MCP.");
	КонецЕсли;
	
КонецПроцедуры

// Поиск в коде через EDT.
&НаКлиенте
// ПоискВКоде.
Процедура ПоискВКоде(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяПроектаEDT) Тогда
		ПоказатьПредупреждение(, "Укажите имя проекта EDT.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекстПоиска) Тогда
		ПоказатьПредупреждение(, "Укажите текст для поиска.");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = ПоискВКодеНаСервере(Объект.ИмяПроектаEDT, Объект.ТекстПоиска);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Поиск в коде", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось выполнить поиск. Проверьте доступность EDT MCP.");
	КонецЕсли;
	
КонецПроцедуры

// Получить метаданные объекта из EDT.
&НаКлиенте
// МетаданныеОбъектаEDT.
Процедура МетаданныеОбъектаEDT(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяПроектаEDT) Тогда
		ПоказатьПредупреждение(, "Укажите имя проекта EDT.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТекстПоиска) Тогда
		ПоказатьПредупреждение(, "Укажите FQN объекта (например, Catalog.Products).");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = ПолучитьМетаданныеEDTНаСервере(Объект.ИмяПроектаEDT, Объект.ТекстПоиска);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Метаданные EDT", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Не удалось получить метаданные. Проверьте FQN объекта.");
	КонецЕсли;
	
КонецПроцедуры

// Проверить доступность EDT MCP.
&НаКлиенте
// ПроверитьEDT.
Процедура ПроверитьEDT(Команда)
	
	Доступен = ПроверитьEDTНаСервере();
	
	Если Доступен Тогда
		ПоказатьПредупреждение(, "EDT MCP (localhost:8764) доступен.");
	Иначе
		ПоказатьПредупреждение(, "EDT MCP (localhost:8764) недоступен.");
	КонецЕсли;
	
КонецПроцедуры

// Поиск объектов метаданных по имени.
&НаКлиенте
// НайтиОбъекты.
Процедура НайтиОбъекты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТекстПоиска) Тогда
		ПоказатьПредупреждение(, "Укажите подстроку имени для поиска.");
		Возврат;
	КонецЕсли;
	
	РезультатJSON = НайтиОбъектыНаСервере(Объект.ТекстПоиска, Объект.ФильтрТиповМетаданных);
	
	Если ЗначениеЗаполнено(РезультатJSON) Тогда
		ПоказатьРезультат("Найденные объекты", РезультатJSON);
	Иначе
		ПоказатьПредупреждение(, "Объекты не найдены.");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СерверныеМетоды

&НаСервереБезКонтекста
Функция ПостроитьДеревоНаСервере(Знач ФильтрТипов)
	
	Попытка
		Возврат КИИ_АнализКонфигурации.ПолучитьДеревоМетаданныхJSON(ФильтрТипов, Истина);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатистикуНаСервере()
	
	Попытка
		Результат = КИИ_АнализКонфигурации.ПолучитьСтатистикуКонфигурации();
		Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазобратьXMLДампНаСервере(Знач ПутьКФайлу)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.РазобратьXMLДампКонфигурации(ПутьКФайлу);
		ТекстОшибки = КИИ_АнализКонфигурации.ТекстОшибкиРазбора(Результат);
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			Возврат "Ошибка: " + ТекстОшибки;
		КонецЕсли;
		Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИзвлечьМодулиНаСервере(Знач ПутьКФайлу, Знач ФильтрОбъектов)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.ИзвлечьМодулиИзXMLДампа(ПутьКФайлу, ФильтрОбъектов);
		ТекстОшибки = КИИ_АнализКонфигурации.ТекстОшибкиРазбора(Результат);
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			Возврат "Ошибка: " + ТекстОшибки;
		КонецЕсли;
		Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОшибкиEDTНаСервере(Знач ИмяПроекта)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.ПолучитьСводкуОшибокEDT(ИмяПроекта);
		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
			Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
		КонецЕсли;
		Возврат Строка(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоискВКодеНаСервере(Знач ИмяПроекта, Знач ТекстПоиска)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.ВыполнитьПоискВКодеЧерезEDT(
			ИмяПроекта, ТекстПоиска, "full", 50);
		Если ТипЗнч(Результат) = Тип("Соответствие") Или ТипЗнч(Результат) = Тип("Массив") Тогда
			Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
		КонецЕсли;
		Возврат Строка(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМетаданныеEDTНаСервере(Знач ИмяПроекта, Знач ОбъектFQN)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.ПолучитьМетаданныеИзEDT(ИмяПроекта, ОбъектFQN, Истина);
		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
			Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
		КонецЕсли;
		Возврат Строка(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьEDTНаСервере()
	
	Возврат КИИ_АнализКонфигурации.ПроверитьДоступностьEDT();
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиОбъектыНаСервере(Знач ПодстрокаИмени, Знач ТипМетаданных)
	
	Попытка
		Результат = КИИ_АнализКонфигурации.НайтиОбъектыМетаданных(ПодстрокаИмени, ТипМетаданных);
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Возврат КИИ_HTTPКлиент.СтруктураВJson(Результат);
		КонецЕсли;
		Возврат Строка(Результат);
	Исключение
		Возврат "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область КлиентскиеМетоды

// Показывает результат в текстовом документе.
&НаКлиенте
// ПоказатьРезультат.
Процедура ПоказатьРезультат(Заголовок, ТекстРезультата)

	// Серверные обработчики возвращают ошибку строкой с префиксом "Ошибка:" - показываем ее
	// предупреждением, а не как успешный результат (fail-open UX, аудит P2).
	Если СтрНачинаетсяС(ТекстРезультата, "Ошибка:") Тогда
		ПоказатьПредупреждение(, ТекстРезультата);
		Возврат;
	КонецЕсли;

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстРезультата);
	ТекстовыйДокумент.Показать(Заголовок);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
